In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [3]:
frame = pd.read_csv('examples/ex1.csv')

In [4]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
frame.to_pickle('examples/frame_pickle')

In [6]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [9]:
store = pd.HDFStore('mydata.h5')

In [10]:
store['obj1']= frame

In [11]:
store['obj1_col'] = frame['a']

In [12]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [13]:
store['obj1']

           a
0   0.184824
1  -1.134914
2   1.141391
3  -0.964721
4  -1.473577
..       ...
95 -0.329273
96 -1.496805
97 -0.267461
98 -0.290546
99  0.805211

[100 rows x 1 columns]

In [14]:
store.put('obj2', frame, format='table')

In [15]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.560875
11  0.353713
12  1.604147
13  1.565064
14  1.054402
15 -1.281336

In [16]:
store.close()

In [17]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [18]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.184824
1 -1.134914
2  1.141391
3 -0.964721
4 -1.473577

In [20]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [21]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [22]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [23]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [25]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [26]:
frame.to_excel(writer, 'Sheet1')

In [27]:
writer.save()

In [28]:
frame.to_excel('examples/ex2.xlsx')

In [29]:
import requests

In [30]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [31]:
resp = requests.get(url)

In [32]:
resp

In [33]:
data = resp.json()

In [34]:
data[0]['title']

'BUG: BusinessDay.apply_index with offset'

In [35]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])

In [36]:
issues

,number,title,labels,state
0,37457,BUG: BusinessDay.apply_index with offset,[],open
1,37456,TST/REF: misplaced .xs tests,[],open
2,37455,CI: Troubleshoot PY38 windows build,[],open
3,37454,ValueError raised when plottting reversed fixe...,[],open
4,37453,BUG: Inconsistent result for corr with constan...,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
5,37452,CLN: Breakup agg,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
6,37451,TST/REF: collect tests by method from test_io,[],open
7,37450,PERF: faster dir() calls,[],open
8,37449,TST/REF: collect tests by method,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
9,37448,BUG: Inconsistent correlation between constant...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
10,37447,DataFrame.to_csv() behaves differently when pa...,[],open
11,37443,ENH: to_latex(): add posibility to define the ...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
12,37442,BUG: read csv with enclosed double quotes,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,37441,BUG: Excessive memory usage after loading Data...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,37436,ENH: std for dt64 dtype,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
15,37429,BUG: cannot safely cast non-equivalent float64...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,37427,BUG: NBC change in reindexing logic of Series....,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
17,37426,PERF: reverted change from commit 7d257c69 to ...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
18,37425,BUG: DataFrame.min/max dt64 with skipna=False,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,37423,"REF: avoid special case in DTA/TDA.median, fle...",[],open
20,37414,BUG: UnicodeDecodeError: 'unicodeescape' codec...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,37406,BUG: Fix inconsistent ordering between left an...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
22,37405,DEPR: Add FutureWarning when matching NaN with...,[],open
23,37402,TST: check_comprehensiveness compat for --lf a...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
24,37401,CI/CLN: Lint more class references in tests,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
25,37398,test_rolling_var_numerical_issues on linux py_...,"[{'id': 563047854, 'node_id': 'MDU6TGFiZWw1NjM...",open
26,37397,RLS: 1.1.4,"[{'id': 131473665, 'node_id': 'MDU6TGFiZWwxMzE...",open
27,37393,DOC: make RST files conform to pandas token usage,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
28,37390,CLN: Deprecate dayofweek/hello day_of_week (#9...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
29,37389,PERF: release gil for ewma_time,"[{'id': 1045950827, 'node_id': 'MDU6TGFiZWwxMD...",open

In [37]:
import sqlite3

In [38]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

In [39]:
con = sqlite3.connect('mydata.sqlite')

In [40]:
con.execute(query)

In [41]:
con.commit()

In [42]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [43]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [44]:
con.executemany(stmt, data)

In [45]:
con.commit()

In [46]:
cursor = con.execute('select * from test')

In [47]:
rows = cursor.fetchall()

In [48]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [49]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [50]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [51]:
import sqlalchemy as sqla

In [53]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [54]:
pd.read_sql('select * from test' ,db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [55]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [56]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [57]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [58]:
string_data[0] = None

In [59]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [60]:
from numpy import nan as NA

In [61]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [62]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [63]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [64]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [65]:
cleaned = data.dropna()

In [66]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [67]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [68]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [69]:
data [4] = NA

In [70]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [71]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [72]:
df = pd.DataFrame(np.random.randn(7, 3))

In [73]:
df.iloc[:4, 1] = NA

In [74]:
df.iloc[:2, 2] = NA

In [75]:
df

          0         1         2
0 -1.070066       NaN       NaN
1  0.847003       NaN       NaN
2  0.779255       NaN  0.279235
3  0.479616       NaN  0.078616
4 -0.066671 -0.322986  0.310270
5 -0.704400 -1.298339 -1.567518
6 -0.343000 -1.337895 -0.424815

In [76]:
df.dropna()

          0         1         2
4 -0.066671 -0.322986  0.310270
5 -0.704400 -1.298339 -1.567518
6 -0.343000 -1.337895 -0.424815

In [77]:
df.dropna(thresh=2)

          0         1         2
2  0.779255       NaN  0.279235
3  0.479616       NaN  0.078616
4 -0.066671 -0.322986  0.310270
5 -0.704400 -1.298339 -1.567518
6 -0.343000 -1.337895 -0.424815

In [78]:
df.fillna(0)

          0         1         2
0 -1.070066  0.000000  0.000000
1  0.847003  0.000000  0.000000
2  0.779255  0.000000  0.279235
3  0.479616  0.000000  0.078616
4 -0.066671 -0.322986  0.310270
5 -0.704400 -1.298339 -1.567518
6 -0.343000 -1.337895 -0.424815

In [79]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.070066  0.500000  0.000000
1  0.847003  0.500000  0.000000
2  0.779255  0.500000  0.279235
3  0.479616  0.500000  0.078616
4 -0.066671 -0.322986  0.310270
5 -0.704400 -1.298339 -1.567518
6 -0.343000 -1.337895 -0.424815

In [80]:
df.fillna(0, inplace=True)

In [81]:
df

          0         1         2
0 -1.070066  0.000000  0.000000
1  0.847003  0.000000  0.000000
2  0.779255  0.000000  0.279235
3  0.479616  0.000000  0.078616
4 -0.066671 -0.322986  0.310270
5 -0.704400 -1.298339 -1.567518
6 -0.343000 -1.337895 -0.424815

In [82]:
df = pd.DataFrame(np.random.randn(6, 3))

In [83]:
df.iloc[2:, 1] = NA

In [84]:
df.iloc[4:, 2] = NA

In [85]:
df

          0         1         2
0  0.980825 -1.029041  0.639841
1 -0.518048 -1.022837  0.411192
2 -2.610119       NaN  1.433907
3  1.192573       NaN  1.477880
4  0.526257       NaN       NaN
5 -0.544497       NaN       NaN

In [86]:
df.fillna(method='ffill')

          0         1         2
0  0.980825 -1.029041  0.639841
1 -0.518048 -1.022837  0.411192
2 -2.610119 -1.022837  1.433907
3  1.192573 -1.022837  1.477880
4  0.526257 -1.022837  1.477880
5 -0.544497 -1.022837  1.477880

In [87]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.980825 -1.029041  0.639841
1 -0.518048 -1.022837  0.411192
2 -2.610119 -1.022837  1.433907
3  1.192573 -1.022837  1.477880
4  0.526257       NaN  1.477880
5 -0.544497       NaN  1.477880

In [88]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [89]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64